; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	satellite5 - satellite
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite7 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	infrared1 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	image3 - mode
	thermograph4 - mode
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph4)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument6 image3)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image3)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument12 infrared1)
	(supports instrument12 spectrograph2)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation2)
	(supports instrument13 thermograph4)
	(calibration_target instrument13 Star3)
	(calibration_target instrument13 GroundStation5)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument14 image3)
	(supports instrument14 spectrograph2)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation0)
	(calibration_target instrument14 Star1)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 GroundStation2)
	(calibration_target instrument15 GroundStation0)
	(supports instrument16 spectrograph2)
	(supports instrument16 thermograph4)
	(supports instrument16 spectrograph0)
	(calibration_target instrument16 GroundStation5)
	(supports instrument17 infrared1)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 GroundStation2)
	(calibration_target instrument17 GroundStation0)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star9)
	(supports instrument18 spectrograph2)
	(supports instrument18 image3)
	(calibration_target instrument18 GroundStation5)
	(supports instrument19 image3)
	(calibration_target instrument19 Star4)
	(calibration_target instrument19 GroundStation2)
	(supports instrument20 infrared1)
	(calibration_target instrument20 GroundStation0)
	(calibration_target instrument20 GroundStation5)
	(on_board instrument18 satellite7)
	(on_board instrument19 satellite7)
	(on_board instrument20 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet8)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Star6)
	(pointing satellite2 GroundStation2)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Star9)
	(have_image Star6 spectrograph0)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Star9 spectrograph0)
	(have_image Planet10 spectrograph2)
))

)

; plan
1. (turn_to satellite3 groundstation0 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 10
2. (turn_to satellite2 groundstation2 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation2)
   goals met: 3 of 10
3. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 10
4. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 10
5. (calibrate satellite1 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 2 of 10
6. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   goals met: 2 of 10
7. (take_image satellite1 planet8 instrument5 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 3 of 10
8. (turn_to satellite1 planet10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet10)
   goals met: 3 of 10
9. (turn_to satellite0 planet10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
10. (take_image satellite1 planet10 instrument5 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 5 of 10
11. (turn_to satellite1 star7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star7)
   goals met: 5 of 10
12. (take_image satellite1 star7 instrument5 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 6 of 10
13. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 6 of 10
14. (take_image satellite1 star9 instrument5 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 7 of 10
15. (turn_to satellite1 star6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star6)
   goals met: 8 of 10
16. (take_image satellite1 star6 instrument5 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 9 of 10
17. (turn_to satellite4 star9 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star9)
   goals met: 10 of 10
